#pragma once

#include <cstdint>

namespace ioi { namespace hm3 {

	class ZGUI
	{
	public:
		virtual void Function_0000(); //#0 +0 .rdata:007a1a54
		virtual void Function_0001(); //#1 +4 .rdata:007a1a58
		virtual void Function_0002(); //#2 +8 .rdata:007a1a5c
		virtual void Function_0003(); //#3 +c .rdata:007a1a60
		virtual void Function_0004(); //#4 +10 .rdata:007a1a64
		virtual void Function_0005(); //#5 +14 .rdata:007a1a68
		virtual void Function_0006(); //#6 +18 .rdata:007a1a6c
		virtual void Function_0007(); //#7 +1c .rdata:007a1a70
		virtual void Function_0008(); //#8 +20 .rdata:007a1a74
		virtual void Function_0009(); //#9 +24 .rdata:007a1a78
		virtual void Function_0010(); //#10 +28 .rdata:007a1a7c
		virtual void Function_0011(); //#11 +2c .rdata:007a1a80
		virtual void Function_0012(); //#12 +30 .rdata:007a1a84
		virtual void Function_0013(); //#13 +34 .rdata:007a1a88
		virtual void Function_0014(); //#14 +38 .rdata:007a1a8c
		virtual void Function_0015(); //#15 +3c .rdata:007a1a90
		virtual void Function_0016(); //#16 +40 .rdata:007a1a94
		virtual void Function_0017(); //#17 +44 .rdata:007a1a98
		virtual void Function_0018(); //#18 +48 .rdata:007a1a9c
		virtual void Function_0019(); //#19 +4c .rdata:007a1aa0
		virtual void Function_0020(); //#20 +50 .rdata:007a1aa4
		virtual void Function_0021(); //#21 +54 .rdata:007a1aa8
		virtual void Function_0022(); //#22 +58 .rdata:007a1aac
		virtual void Function_0023(); //#23 +5c .rdata:007a1ab0
		virtual void Function_0024(); //#24 +60 .rdata:007a1ab4
		virtual void Function_0025(); //#25 +64 .rdata:007a1ab8
		virtual void Function_0026(); //#26 +68 .rdata:007a1abc
		virtual void Function_0027(); //#27 +6c .rdata:007a1ac0
		virtual void Function_0028(); //#28 +70 .rdata:007a1ac4
		virtual void Function_0029(); //#29 +74 .rdata:007a1ac8
		virtual void Function_0030(); //#30 +78 .rdata:007a1acc
		virtual void Function_0031(); //#31 +7c .rdata:007a1ad0
		virtual void Function_0032(); //#32 +80 .rdata:007a1ad4
		virtual void Function_0033(); //#33 +84 .rdata:007a1ad8
		virtual void Function_0034(); //#34 +88 .rdata:007a1adc
		virtual void Function_0035(); //#35 +8c .rdata:007a1ae0
		virtual void Function_0036(); //#36 +90 .rdata:007a1ae4
		virtual void Function_0037(); //#37 +94 .rdata:007a1ae8
		virtual void Function_0038(); //#38 +98 .rdata:007a1aec
		virtual void Function_0039(); //#39 +9c .rdata:007a1af0
		virtual void Function_0040(); //#40 +a0 .rdata:007a1af4
		virtual void Function_0041(); //#41 +a4 .rdata:007a1af8
		virtual void Function_0042(); //#42 +a8 .rdata:007a1afc
		virtual void Function_0043(); //#43 +ac .rdata:007a1b00
		virtual void Function_0044(); //#44 +b0 .rdata:007a1b04
		virtual void Function_0045(); //#45 +b4 .rdata:007a1b08
		virtual void Function_0046(); //#46 +b8 .rdata:007a1b0c
		virtual void Function_0047(); //#47 +bc .rdata:007a1b10
		virtual void Function_0048(); //#48 +c0 .rdata:007a1b14
		virtual void Function_0049(); //#49 +c4 .rdata:007a1b18
		virtual void Function_0050(); //#50 +c8 .rdata:007a1b1c
		virtual void Function_0051(); //#51 +cc .rdata:007a1b20
		virtual void Function_0052(); //#52 +d0 .rdata:007a1b24
		virtual void Function_0053(); //#53 +d4 .rdata:007a1b28
		virtual void Function_0054(); //#54 +d8 .rdata:007a1b2c
		virtual void Function_0055(); //#55 +dc .rdata:007a1b30
		virtual void Function_0056(); //#56 +e0 .rdata:007a1b34
		virtual void Function_0057(); //#57 +e4 .rdata:007a1b38
		virtual void Function_0058(); //#58 +e8 .rdata:007a1b3c
		virtual void Function_0059(); //#59 +ec .rdata:007a1b40
		virtual void Function_0060(); //#60 +f0 .rdata:007a1b44
		virtual void Function_0061(); //#61 +f4 .rdata:007a1b48
		virtual void Function_0062(); //#62 +f8 .rdata:007a1b4c
		virtual void Function_0063(); //#63 +fc .rdata:007a1b50
		virtual void Function_0064(); //#64 +100 .rdata:007a1b54
		virtual void Function_0065(); //#65 +104 .rdata:007a1b58
		virtual void Function_0066(); //#66 +108 .rdata:007a1b5c
		virtual void Function_0067(); //#67 +10c .rdata:007a1b60
		virtual void Function_0068(); //#68 +110 .rdata:007a1b64
		virtual void Function_0069(); //#69 +114 .rdata:007a1b68
		virtual void Function_0070(); //#70 +118 .rdata:007a1b6c
		virtual void Function_0071(); //#71 +11c .rdata:007a1b70
		virtual void Function_0072(); //#72 +120 .rdata:007a1b74
		virtual void Function_0073(); //#73 +124 .rdata:007a1b78
		virtual void Function_0074(); //#74 +128 .rdata:007a1b7c
		virtual void Function_0075(); //#75 +12c .rdata:007a1b80
		virtual void Function_0076(); //#76 +130 .rdata:007a1b84
		virtual void Function_0077(); //#77 +134 .rdata:007a1b88
		virtual void Function_0078(); //#78 +138 .rdata:007a1b8c
		virtual void Function_0079(); //#79 +13c .rdata:007a1b90
		virtual void Function_0080(); //#80 +140 .rdata:007a1b94
		virtual void Function_0081(); //#81 +144 .rdata:007a1b98
		virtual void Function_0082(); //#82 +148 .rdata:007a1b9c
		virtual void Function_0083(); //#83 +14c .rdata:007a1ba0
		virtual void Function_0084(); //#84 +150 .rdata:007a1ba4
		virtual void Function_0085(); //#85 +154 .rdata:007a1ba8
		virtual void Function_0086(); //#86 +158 .rdata:007a1bac
		virtual void Function_0087(); //#87 +15c .rdata:007a1bb0
		virtual void Function_0088(); //#88 +160 .rdata:007a1bb4
		virtual void Function_0089(); //#89 +164 .rdata:007a1bb8
		virtual void Function_0090(); //#90 +168 .rdata:007a1bbc
		virtual void Function_0091(); //#91 +16c .rdata:007a1bc0
		virtual void Function_0092(); //#92 +170 .rdata:007a1bc4
		virtual void Function_0093(); //#93 +174 .rdata:007a1bc8
		virtual void Function_0094(); //#94 +178 .rdata:007a1bcc
		virtual void Function_0095(); //#95 +17c .rdata:007a1bd0
		virtual void Function_0096(); //#96 +180 .rdata:007a1bd4
		virtual void Function_0097(); //#97 +184 .rdata:007a1bd8
		virtual void Function_0098(); //#98 +188 .rdata:007a1bdc
		virtual void Function_0099(); //#99 +18c .rdata:007a1be0
		virtual void Function_0100(); //#100 +190 .rdata:007a1be4
		virtual void Function_0101(); //#101 +194 .rdata:007a1be8
		virtual void Function_0102(); //#102 +198 .rdata:007a1bec
		virtual void Function_0103(); //#103 +19c .rdata:007a1bf0
		virtual void Function_0104(); //#104 +1a0 .rdata:007a1bf4
		virtual void Function_0105(); //#105 +1a4 .rdata:007a1bf8
		virtual void Function_0106(); //#106 +1a8 .rdata:007a1bfc
		virtual void Function_0107(); //#107 +1ac .rdata:007a1c00
		virtual void Function_0108(); //#108 +1b0 .rdata:007a1c04
		virtual void Function_0109(); //#109 +1b4 .rdata:007a1c08
		virtual void Function_0110(); //#110 +1b8 .rdata:007a1c0c
		virtual void Function_0111(); //#111 +1bc .rdata:007a1c10
		virtual void Function_0112(); //#112 +1c0 .rdata:007a1c14
		virtual void Function_0113(); //#113 +1c4 .rdata:007a1c18
		virtual void Function_0114(); //#114 +1c8 .rdata:007a1c1c
		virtual void Function_0115(); //#115 +1cc .rdata:007a1c20
		virtual void Function_0116(); //#116 +1d0 .rdata:007a1c24
		virtual void Function_0117(); //#117 +1d4 .rdata:007a1c28
		virtual void Function_0118(); //#118 +1d8 .rdata:007a1c2c
		virtual void Function_0119(); //#119 +1dc .rdata:007a1c30
		
		/// ---------- MEMBERS -----------
		uint32_t m_entityLocator; //0x0004
		char pad_0008[4]; //0x0008
		uint32_t __MEMCHECK__; //0x000C [should be equal to 0x50000, otherwise memory corrupted!]
		int32_t m_uiFlags; //0x0010
		char pad_0014[16]; //0x0014
		int32_t m_uiMapState; //0x0024
		char pad_0028[12]; //0x0028
		uint32_t m_postFilterCollectionEvent; //0x0034
		uint32_t m_postFilterEvent; //0x0038
		uint32_t m_postFilterSetEvent; //0x003C
		char pad_0040[28]; //0x0040
		uint32_t m_inventoryMenu; //0x005C
		char pad_0060[212]; //0x0060
		int32_t m_isWeaponShowed; //0x0134
		char pad_0138[32]; //0x0138
		uint32_t m_camera; //0x0158
		uint32_t m_cameraClass; //0x015C
		char pad_0160[92]; //0x0160
		uint32_t m_weaponDisplay; //0x01BC
		char pad_01C0[4]; //0x01C0
		int32_t m_iconClassId; //0x01C4
		char pad_01C8[16]; //0x01C8
		uint32_t m_infoDisplay; //0x01D8
		char pad_01DC[240]; //0x01DC
		uint32_t m_cheatMenu; //0x02CC
		char pad_02D0[16]; //0x02D0
		uint32_t m_pickupMenu; //0x02E0
		char pad_02E4[16]; //0x02E4
		uint32_t m_dropDisplay; //0x02F4
		char pad_02F8[16]; //0x02F8
		uint32_t m_actionMenu; //0x0308
		char pad_030C[16]; //0x030C
		uint32_t m_containerMenu; //0x031C
		char pad_0320[32]; //0x0320
	};

}}

#undef MEMBER_PAD
#undef CONCAT
#undef CONCAT_IMPL